emacs-config.org
#+TITLE: Emacs literate configuration
#+AUTHOR: Javier Castilla
#+EMAIL: jcastp@pm.me
#+LANGUAGE: en
#+STARTUP: overview

* Summary
This is the literate config for my emacs use cases.

I will try to document and compartmentalize the files, so it's easier to follow up.

In order to make this work, you need to load this file in =emacs= and use the =org-babel-tangle= command (bound to =C-c C-v C-t= in a vanilla =emacs=). This will generate the different config files needed, shown in the structure below:

#+begin_example
.emacs.d/
├── early-init.el
├── init.el
├── emacs-config.org        <-- this file
├── modules
│   └── my-org.el
│   └── my-org-visuals.el
...
#+end_example

The =modules= directory will contain all my complementary config files, separated by topic or use case.

* Early-init file
Used to load the initial emacs config, prior to building the first frame.

** Inhibit the package loading at emacs startup

#+begin_src emacs-lisp :tangle "early-init.el" :mkdirp yes
  ;;; early-init.el --- Early Init -*- lexical-binding: t; -*-
  ;;
  ;;; Commentary:
  ;;
  ;;; Code:
  (setq package-enable-at-startup nil)
#+end_src

** Garbage collection config
Initial garbage collection config for the startup.

#+begin_src emacs-lisp :tangle "early-init.el" :mkdirp yes
  (setq gc-cons-threshold (* 1024 1024 20))
  (setq gc-cons-percentage 0.5)
#+end_src
  
** custom file loading
Load my own =custom.el= file

#+begin_src emacs-lisp :tangle "early-init.el" :mkdirp yes
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src
** frame related config
These are properties that need to be defined before emacs generates the frame.

#+begin_src emacs-lisp :tangle "early-init.el" :mkdirp yes
  ;; Set the frame size according to pixels and not based on the size of the font.
  (setq frame-resize-pixelwise t)

  ;; Inhibit resizing the frame when changing the font
  (setq frame-inhibit-implied-resize t)
#+end_src

* init file
** some variables for elisp

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  ;; lisp evaluation of recursion
  (setq max-lisp-eval-depth 5000)

  ;; amount of lisp variables before throwing an exception
  ;;(setq max-specpdl-size 5000) ;; obsolete from 29.1
  #+end_src

** Remove all the graphic candy from the frame
I have no need to see the graphical parts of the emacs GUI.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src
  
** Remove the initial screens
I don't need to get the initial screens when loading emacs.

  #+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  ;; disable splash and startup screens
  (setq inhibit-splash-screen t
      inhibit-startup-screen t
      )
#+end_src

** =straight= package bootstrap
=straight= is not part of emacs, so we need to bootstrap it.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  ;; ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; straight.el bootstrap
  ;; develop branch
  (setq straight-repository-branch "develop")

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Use straight.el for use-package expressions
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

  ;; While that enables the :straight t extension to use-package, let's just have that be the default:
  (use-package straight
    :custom (straight-use-package-by-default t
  					   straight-default-vc 'git))
#+end_src
** Configure the config and data directories
- Config directory contains the files that will be commited. All the files that will get emacs up and running will be here.
- Data directory contains the files that should no be commited, but contains my own information, that is useful.
  
We will be using this either with concat or expand-file-name:
- expand-file-name for when we have just a filename
- concat for when we have a composite directory and filename, or as a secondary way to do it.
  
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (defvar my-config-dir "~/.emacs.d/")
  (defvar my-data-dir "~/Nextcloud/config/.emacs.d/")
#+end_src

** System information
Special variables to execute code based on machine, location, etc.

*** based on machine names
Defining variables for conditional execution, based on machine names:
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  ;; working laptop vm
  (defvar my-worksystem-p (equal (system-name) "lubuntuwork"))
  ;; My desktop machine, able to run anything
  (defvar my-desktopsystem-p (or
  			    (equal (system-name) "olimpo")
  			    (equal (system-name) "doomslayer")))
  ;; Writing machines
  ;; probably we can strip some features from them, as they are low end machines
  (defvar my-writinglaptop-p (or
  			    (equal (system-name) "argos")
  			    (equal (system-name) "caliope")))
#+end_src

*** based on environment variables
Home or work environment. We establish the variable from the command line, with this line.
#+begin_src bash
  export WORKING=HOME && emacs &
#+end_src

With this, we capture the variable, and will execute some config depending on them.
We define the home env if it is =HOME= or if it is not =WORK=.
We define the work env only if it is specifically stated as =WORK=.
There are better logical ways to do this, but I leave it here as a clear way to understand.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (defvar my-homeenvironment-p (or
  			      (string= (getenv "WORKING") "HOME")
  			      (not (string= (getenv "WORKING") "WORK")))
    )
  (defvar my-workenvironment-p (string= (getenv "WORKING") "WORK"))
#+end_src

** Remove the warnings of the packages being installed
From https://github.com/howardabrams/hamacs:
"Getting tired off all the packages that I load spewing a bunch of warnings that I can't do anything about:"

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (when (and (fboundp 'native-comp-available-p)
             (native-comp-available-p))
    (setq native-comp-async-report-warnings-errors nil
          native-comp-deferred-compilation t))
#+end_src

** TODO Check if my encrypted directory is mounted
I have some cloud directories synced that are encrypted. Some emacs config information is contained there, so I need to be sure the directory is correctly mounted in a clear directory.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  ;; define my clear directory
  (setq my-clear-directory (expand-file-name "Nextcloud_claro/gocryptfs_claro" (getenv "HOME")))

  ;; check the directory exists
  ;;(file-directory-p my-clear-directory)

  ;; check if a directory is a mount point - against "mount" command in the OS.
  (defun is-mount-point-p (path)
    "Check if the given PATH is a mount point."
    (let ((mount-output (shell-command-to-string "mount")))
      (string-match (regexp-quote path) mount-output)))

  ;; This variable will control if my encrypted dir is mounted on the clear directory
  (defvar my-clear-directory-is-mounted-p 0
    "My clear directory is correctly mounted")

  ;; Check if the directory is mounted
  (if (is-mount-point-p my-clear-directory)
      ;; if it is mounted, we change the variable
      (setq my-clear-directory-is-mounted-p t)
    ;; if it is not mounted, then we should launch the script here
    (progn
      ;; I think we should not launch this from here, but just examine what is wrong in the OS.
      ;;(shell-command "bash ~/Nextcloud/config/mount-encrypted-dirs.sh")
      )
    )
#+end_src
** Establish the different modules
Here we define the modules we want to load

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  ;; create a custom list for the files I want to load
  (setq my-modules-list '(
  			;; personal information
  			"my-personal.el"
  			;; git related config
  			"my-git.el"
  			;; general config
  			"my-general.el"
  			;; completion and search frameworks
  			"my-completion.el"
  			;; navigation aids
  			"my-navigation.el"
  			;; fonts and themes
  			"my-fonts.el"
  			"my-themes.el"
  			;; UI improvements
  			"my-ui.el"
  			;; org mode config
  			"my-org.el"
  			"my-org-agenda.el"
  			"my-org-export.el"
  			"my-org-roam.el"
  			"my-org-visuals.el"
  			;; my writing aids
  			"my-writing.el"
  			;; programming aids
  			"my-programming.el"
  			;; misc code and aids
  			"my-misc.el"
  			;; load the dashboard
  			"my-dashboard.el"
  			;; testing zone
  			"my-testing.el"
  			;; home related code
  			"my-home.el"
  			))
#+end_src

** Load work related config, if applicable
We need to load the work configuration depending on the variables set in the linux environment.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  ;; Load this config when using the work computer
  (if my-workenvironment-p
      (progn
        ;; add the work config file at the end of the list, so it is evaluated at the end.
        (add-to-list 'my-modules-list "my-work.el" t)
        )
    )
 #+end_src

** Load all the packages
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
    ;; the directory where I store my modules
    (add-to-list 'load-path (concat user-emacs-directory "modules/"))
    
    (dolist (file my-modules-list)
      (load file))
#+end_src

* git related config

** magit
git control version
https://cestlaz-nikola.github.io/posts/using-emacs-47-magit/

#+begin_src emacs-lisp :tangle "modules/my-git.el" :mkdirp yes
  (use-package magit
    :straight t
    :config
    (global-set-key (kbd "C-x g") 'magit-status)
    )
  #+end_src
  
** git-gutter
Adds visual cues on the side of the frame for changes from the last commit.

https://cestlaz-nikola.github.io/posts/using-emacs-42-git-gutter/

I need to configure the key bindings to jump from one change to another.

  #+begin_src emacs-lisp :tangle "modules/my-git.el" :mkdirp yes
    (use-package git-gutter
      :straight t
      :init
      (global-git-gutter-mode +1)
      )
#+end_src

* Personal
Here, I put my personal information and all the packages related to accounts.

** Personal information
#+begin_src emacs-lisp :tangle "modules/my-personal.el" :mkdirp yes
  ;; to protect my personal information, this file is not commited
  (load (expand-file-name "Nextcloud/config/.emacs.d/personal_info.el" (getenv "HOME")))
#+end_src

** TODO mastodon from emacs
I can now check mastodon from emacs.
Only evaluated if in my home env, and my encrypted directory is mounted, as the auth information is stored there.

#+begin_src emacs-lisp :tangle "modules/my-testing.el" :mkdirp yes
  (if (and my-clear-directory-is-mounted-p my-homeenvironment-p)
      (use-package mastodon
        :straight t
        :bind
        ("C-c d m" . mastodon)
        :config
        ;; account configuration
        (setq mastodon-instance-url "https://mastodon.online"
  	    mastodon-active-user "jcastp")
        ;; my auth information is now in my encrypted directory
        (setq mastodon-client--token-file (expand-file-name "personal/emacs/mastodon.plstore" my-clear-directory))
        )
    )
#+end_src

* General config

** Unmap the C-z key
Unmap the C-z key, so no way to minimize or suspend emacs accidentally.

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (global-unset-key (kbd "C-z"))
#+end_src

** Garbage collection
Fine tune the garbage collection.

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  ;; Adopt a sneaky garbage collection strategy of waiting until idle
  ;; time to collect; staving off the collector while the user is
  ;; working.  Thanks Doom -
  ;; https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly

  (use-package gcmh
    :straight t
    :diminish gcmh-mode
    :custom
    (gcmh-mode 1)
    (gcmh-idle-delay 10)
    (gcmh-high-cons-threshold (* 32 1024 1024))
    (gc-cons-percentage 0.8)
    )
#+end_src

** Start with a maximized frame
#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** Minibuffer completion
https://www.masteringemacs.org/article/understanding-minibuffer-completion
https://git.sr.ht/~ashton314/emacs-bedrock/tree/main/item/init.el
#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (setq enable-recursive-minibuffers t)  ; Use the minibuffer whilst in the minibuffer
  (setq completion-cycle-threshold 1)    ; TAB cycles candidates
  (setq completions-detailed t)          ; Show annotations
  (setq tab-always-indent 'complete)     ; When I hit TAB, try to complete, otherwise, indent
#+end_src

** fringe bars
We put some fringe space in the frames.

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (fringe-mode 8)
#+end_src

** Changes all yes/no questions to y/n type
The questions are answered with a y or n, instead of yes or no.

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** Ask before closing emacs
To avoid closing everything because I slip my finger ...

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (setq confirm-kill-emacs 'y-or-n-p)
#+end_src

** Network security set to high
Enforcing the network security.

https://www.gnu.org/software/emacs/manual/html_node/emacs/Network-Security.html

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (setq network-security-level 'high)
#+end_src

** No lock files, but backups
No lock files created.

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (setq create-lockfiles nil)
#+end_src

But backups are good to have:
#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  ;; backup in one place. flat, no tree structure
  ;; TODO change this to the variables for directories as it does not work as expected
  ;;(setq backup-directory-alist '(("" . (concat my-data-dir "backups"))))
  (setq backup-directory-alist '(("" . "~/Nextcloud/config/.emacs.d/backups")))
  ;; What if the file is linked? We copy the file
  (setq backup-by-copying t)
  ;; Version control
  (setq delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        version-control t
        )
#+end_src

** utf-8 everywhere
UTF-8 everywhere

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  ;; make sure that UTF-8 is used everywhere.
  (set-terminal-coding-system  'utf-8)
  (set-keyboard-coding-system  'utf-8)
  (set-language-environment    'utf-8)
  (set-selection-coding-system 'utf-8)
  (setq locale-coding-system   'utf-8)
  (prefer-coding-system        'utf-8)
  (set-input-method nil)
#+end_src

** Movement
Some keys redefined to better adjust to the whole emacs key environment.

#+begin_src emacs-lisp :tangle "modules/my-general.el" :mkdirp yes
  (global-set-key (kbd "M-p") 'backward-paragraph)
  (global-set-key (kbd "M-n") 'forward-paragraph)
#+end_src

